Tekla.Structures.DirectManipulation.Model.IPourBreakPreviewSelector
The Tekla.Structures.DirectManipulation.Model.IPourBreakPreviewSelector interface provides the methods for calculating pour break previews.

Tekla.Structures.DirectManipulation.Model.IPourBreakPreviewSelector.GetSinglePolygonPolymeshes(Tekla.Structures.Model.ModelObject,System.Collections.Generic.IDictionary{Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.UnitVector3},System.Boolean)
Gets the polymeshes (preview or actual) based on the given input.
modelObject: The model object lying under the input planes.
inputPlanes: The input planes defined as pairs of point and normal.
actual: True for actual polymeshes, false for preview.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep objects containing the preview/actual polymeshes if they could be generated
or null if no preview/actual polygons could be generated.

Tekla.Structures.DirectManipulation.Model.IPourBreakPreviewSelector.GetPreviewPolylinePolymeshesForCreation(Tekla.Structures.Model.ModelObject,System.Collections.Generic.IList{Tekla.Common.Geometry.Vector3},Tekla.Common.Geometry.UnitVector3)
Gets the preview polymeshes for the creation of a polyline pour break.
modelObject: The model object under the picked point(s).
polylinePoints: The input polyline points.
extensionDirection: The input extension direction.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep polymeshes if the preview polymeshes could be generated.
Otherwise, null if no preview polymesh could be generated.

Tekla.Structures.DirectManipulation.Model.IPourBreakPreviewSelector.GetActualPolylinePolymeshesForCreation(Tekla.Structures.Model.ModelObject,Tekla.Structures.Geometry3d.FacetedBrep)
Gets the actual geometry polymeshes for the creation of a polyline pour break.
modelObject: The model object lying under the picked point(s).
pourBreakPolymesh: The input polymesh.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep polymeshes if the actual geometry polymeshes could be generated.
Otherwise, null if no actual geometry polymesh could be generated.

Tekla.Structures.DirectManipulation.Model.IPourBreakPreviewSelector.GetPreviewPolylinePolymeshesForModification(Tekla.Structures.Model.PourBreak,System.Collections.Generic.IList{Tekla.Common.Geometry.Vector3},Tekla.Common.Geometry.UnitVector3)
Gets the preview polymeshes for the modification of a pour break.
pourBreak: The pour break being modified.
polylinePoints: The input polyline points.
extensionDirection: The input extension direction.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep polymeshes containing the preview polygons if they could be generated.
Otherwise, null if no preview polymesh could be generated.

Tekla.Structures.DirectManipulation.Model.IPourBreakPreviewSelector.GetActualPolylinePolymeshesForModification(Tekla.Structures.Model.PourBreak,Tekla.Structures.Geometry3d.FacetedBrep)
Gets the actual geometry polymeshes for the modification of a pour break.
pourBreak: The pour break being modified.
pourBreakPolymesh: The input polymesh.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep polymeshes if the actual geometry polymeshes could be generated.
Otherwise, null if no actual polymesh could be generated.

Tekla.Structures.DirectManipulation.Model.IPourBreakPreviewSelector.GetPreviewPolylinePolymeshesForSplitting(Tekla.Structures.Model.ModelObject,System.Collections.Generic.IList{Tekla.Common.Geometry.Vector3},Tekla.Common.Geometry.UnitVector3)
Gets the preview polymeshes for the creation of a polyline split
modelObject: The model object under the picked point(s).
polylinePoints: The input polyline points.
extensionDirection: The input extension direction.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep polymeshes if the preview polymeshes could be generated.
Otherwise, null if no preview polymesh could be generated.

Tekla.Structures.DirectManipulation.Model.IPourBreakPreviewSelector.GetActualPolylinePolymeshesForSplitting(Tekla.Structures.Model.ModelObject,Tekla.Structures.Geometry3d.FacetedBrep)
Gets the actual validated geometry polymeshes for the creation of a polyline split
modelObject: The model object (part) lying under the picked point(s).
splitPolymesh: The input polymesh.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep polymeshes if the actual geometry polymeshes could be generated.
Otherwise, null if no actual geometry polymesh could be generated.